/*
1. 자료구조 & 알고리즘은 무엇인가?
- 자료구조: 어떤 데이터(*자료)가 어떤 형태(*구조)로 저장이 되고, 어떻게 사용되는지를 나타내는 것
  => 아마추어 // 프로
- 알고리즘: 어떤 문제를 해결하기 위한 확실한 해결방법

2. 왜 갈수록 중효해지고 있을까?
- 전공과목 > 지금 당장 코드를 작성하는데 큰 영향을 주지 못함
- 비전공자 > 3년차
- 기본코드 > AI가 더 잘 만들어준다.

3. 어떤 자료구조와 알고리즘을 사용하는 것이 효과적인가? 를 어떻게 구분.판단?
- 시간복잡도 (*알고리즘 효율성 측정 척도) 개념 적용
- 시간복잡도 => 해당 문제를 해결하기 위해서 얼만큼 시간이 걸렸는가
- 코드를 실행하고 결과값을 도출하는데 걸리는 시간
- 만약 코드 스타트 => 코드 종료 (* 단순 처리시간만 체크) => 이 방식으로는 문제가 있다!
- 순수하게 코드 자체만으로도 해당 코드의 효율성을 측정해야 할 필요 존재남ㅈ 
- 코드를 보고, 코드안에 어떤 문제를 해결하는데 있어서 가장 많은 시간을 소비할 것으로 판단되는 요소의 실행 횟수 및 개수
- 반복문을 활용해서 반복을 많이 하면 할수록 문제를 처리하는데 소요되는 시간은
*/

// ex.1

// ex.3
// 아래 주어진 배열에서 5를 찾아보세요!!
const arr01 = [1, 3, 5, 7];
